models/deepseek-v2-lite/benchmark_results/p95_stress_20260315_110626/p95_stress.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x754198f5d9e0>, seed=1132, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=15840, random_output_len=561, random_range_ratio=0.0, random_prefix_len=12000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p95_stress_20260315_110626', result_filename='p95_rate1_20260315_110626.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-203bdac1-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-15 11:09:21 [datasets.py:611] Sampling input_len from [15839, 15839] and output_len from [561, 561]
Token indices sequence length is longer than the specified maximum sequence length for this model (29000 > 16384). Running this sequence through the model will result in indexing errors
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [04:21<00:00,  1.31s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  261.80    
Total input tokens:                      5567800   
Total generated tokens:                  112200    
Request throughput (req/s):              0.76      
Output token throughput (tok/s):         428.57    
Peak output token throughput (tok/s):    500.00    
Peak concurrent requests:                56.00     
Total token throughput (tok/s):          21695.68  
---------------Time to First Token----------------
Mean TTFT (ms):                          22601.99  
Median TTFT (ms):                        23341.76  
P50 TTFT (ms):                           23341.76  
P90 TTFT (ms):                           36457.37  
P95 TTFT (ms):                           40089.29  
P99 TTFT (ms):                           43388.58  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.72     
Median TPOT (ms):                        38.97     
P50 TPOT (ms):                           38.97     
P90 TPOT (ms):                           39.40     
P95 TPOT (ms):                           39.43     
P99 TPOT (ms):                           39.48     
---------------Inter-token Latency----------------
Mean ITL (ms):                           38.72     
Median ITL (ms):                         38.44     
P50 ITL (ms):                            38.44     
P90 ITL (ms):                            39.87     
P95 ITL (ms):                            41.27     
P99 ITL (ms):                            71.94     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          44286.08  
Median E2EL (ms):                        45418.07  
P50 E2EL (ms):                           45418.07  
P90 E2EL (ms):                           58301.61  
P95 E2EL (ms):                           61262.56  
P99 E2EL (ms):                           63527.50  
==================================================